{"narration":{"events":[{"epoch":200771,"text":"<p>Welcome to Apollo 13 Real-time. This is a deep-dive educational experience on the six hours immediately following the Apollo 13 accident.</p>"},{"epoch":200780,"text":"<p>Presently, the crew is wrapping up a TV broadcast, and Mission Control is preparing some housekeeping tasks before sleep period. The accident will not occur for almost another ten minutes.</p>"},{"epoch":200790,"text":"<p>In the meantime, let's go over some basics and information about the Apollo spacecraft, Mission Control, and this website.</p><p>If you would rather this narration go away, you can <a href=\"#ref-only\">click here</a>.</p>"},{"epoch":200800,"text":"<p>This is the Apollo spacecraft. It's made up of four modules mated together. Together like this, it's sometimes called a <span class=\"glossary-term\">stack</span>.</p>"},{"epoch":200805,"text":"<p>The two primary spacecraft are the Command and Service Module (referred to as the CSM), and the Lunar Module (called the LM).</p>"},{"epoch":200810,"text":"<p>But the Service Module could separate from the Command Module, and was discarded before reëntry to Earth. And the Lunar Module also came apart into the Descent Stage, which was left on the Lunar surface to save weight, and the Ascent Stage, which took the astronauts back to the CSM to go home.</p>"},{"epoch":200870,"text":"<p>Apollo had a travel companion: the S-IVB stage, part of the Saturn V rocket, was responsible for the heavy lifting of sending the spacecraft from Earth orbit all the way out to intercept the Moon.</p><p>For the first time on Apollo 13, the S-IVB was directed to impact the Moon rather than boost away into a safe Solar orbit, as a seismometer had been left behind by Apollo 12. This change meant that they left its computer and radio equipment running. This detail will become important later.</p>"},{"epoch":200885,"text":"<p>Together, the Command and Service Modules (referred to as the CSM) would orbit the Moon, while the Lunar Module (LM) would descend to the Lunar surface.</p>"},{"epoch":200892,"text":"<p>To return from the surface, the Lunar Module would leave behind a lot of heavy equipment and fuel to save weight. The portion that returned is known as the Ascent stage; the part that's left behind is the Descent stage.</p><p>Each stage had its own batteries, tanks, and engine, with the Descent engine being more powerful and featureful.</p>"},{"epoch":200900,"text":"<p>On their way to the Moon, however, all these stages were mated together to form the complete Apollo spacecraft. During this phase of the mission, the Service Module provided most of the consumables (power, oxygen, and so on) and did most of the work, aided by the Command Module instrumentation and computer.</p>"},{"epoch":200910,"text":"<p>In reality, it wouldn't just remain stationary like this, however, because in space the temperature difference between Sun and shade become extreme without air to diffuse the temperature.</p><p>Thermal management is a huge concern in spaceflight. Too hot, and delicate components could fry; too cold, and they might stop working.</p>"},{"epoch":200860,"text":"<p>For this reason, there are heaters to keep many internal components at operating temperature ranges.</p><p>Also for this reason, the spacecraft was usually put into a Passive Thermal Control (PTC) mode, in which the spacecraft was put into a slow <span class=\"glossary-term\">roll</span> to \"cook\" the spacecraft slowly and evenly.  We would animate this for you, but it's a 2D drawing. Sorry!</p>"},{"epoch":200930,"text":"<p>Now that we've brought up <span class=\"glossary-term\">roll</span>, this is a good time to talk about <span class=\"glossary-term\">attitude</span>.</p><p>The spacecraft's attitude is its orientation relative to \"the universe.\" It can be described at any time with three values: <span class=\"glossary-term\">pitch</span>, <span class=\"glossary-term\">roll</span>, and <span class=\"glossary-term\">yaw</span>.</p><p>Pitch is like an airplane turning to climb or fall. Roll is like rotating the Apollo hot dog on a stick. And yaw is spinning a spinner on a table.</p>"},{"epoch":200940,"text":"<p>It is important to keep track of the spacecraft's <span class=\"glossary-term\">attitude</span> at all times. Among other reasons, this ensures that when the crew perform burns to correct the spacecraft's trajectory, they know which way to point the vehicle.</p><p>To do this, astronauts turn to the same guides as did mariners upon the ancient sea: the stars.</p><p>By using a variety of telescopes and sextants mounted at known positions on board the spacecraft, such as the Alignment Optical Telescope (<span class=\"glossary-term\">AOT</span>) and Crewman Optical Alignment Sight (<span class=\"glossary-term\">COAS</span>), the astronauts could take readings of known stars and determine their <span class=\"glossary-term\">attitude</span>.</p>"},{"epoch":200948,"text":"<p>They didn't have to do the math, however, or even read out the angles themselves: the Apollo Guidance Computer (<span class=\"glossary-term\">AGC</span>) assisted in this task. During a program P51 from-scratch alignment, the crew could inform the computer once they had pointed the telescope precisely at a known star, and the computer would take a sample. They then needed only to tell it which star it was, and repeat the task for a second star.</p><p>During a P52 alignment confirmation, the computer would even point the telescope automatically at stars, and the crew needed only to adjust and confirm.</p>"},{"epoch":200960,"text":"<p>It is one thing to determine the <span class=\"glossary-term\">attitude</span> at one point in time; it is another to keep it updated as the spacecraft drifted around. Without air resistance to slow motion, it was essentially impossible to simply remain fixed.</p><p>This was accomplished using an advanced gyroscope system, called the Inertial Measurement Unit (<span class=\"glossary-term\">IMU</span>).</p>"},{"epoch":200968,"text":"<p>The <span class=\"glossary-term\">IMU</span> works much the way a compass would resting in your palm: a freely rotating <em>stable member</em> (in this case, the compass needle) remains fixed relative to a reference point (the Earth's magnetic field) even if you yourself turn around.</p><p>In the case of a typical gyroscopic system like the IMU, the force that holds the stable member (the box in the middle) fixed is angular momentum rather than magnetism, but the principle is generally the same. The orientation of the stable member relative to the spacecraft it is mounted to can then be read by <span class=\"glossary-term\">resolvers</span> in the rings.</p>"},{"epoch":200980,"text":"<p>The <span class=\"glossary-term\">IMU</span>, however, is special and advanced. Its stable member is not held stationary by angular momentum. Rather, the sensitive smaller gyroscope instruments are fed into servo motors that actively drive the stable member to hold it still relative to the universe.</p><p>This is important because it is often necessary to shift the stable member around to avoid <span class=\"glossary-term\">gimbal lock</span>.</p>"},{"epoch":200986,"text":"<p>It's not especially important why, but with only three gimbal rings, the <span class=\"glossary-term\">IMU</span> is susceptible to a condition known as <span class=\"glossary-term\">gimbal lock</span>: the stable member can't stay fixed if the spacecraft rotates through certain angles relative to it. It'll instead get dragged along, ruining the reference.</p><p>Because of this, the stable member would be deliberately placed at certain angles chosen based on the activities the crew was performing, to minimize the chance this happens. It could be moved quickly but imprecisely, in a <span class=\"glossary-term\">coarse align</span> procedure, or torqued incrementally and carefully as part of a <span class=\"glossary-term\">fine align</span>.</p>"},{"epoch":201000,"text":"<p>The combination of maintaining a healthy IMU and understanding the spacecraft's <span class=\"glossary-term\">attitude</span> was called a <span class=\"glossary-term\">platform</span>. When you hear people in the audio refer to the platform, this is what they mean.</p><p>Even if everything was done correctly, the IMU could drift over time, and the platform would need to be recalibrated. A P52 was usually done to accomplish this reconfirmation, after which the IMU might be adjusted slightly with a <span class=\"glossary-term\">fine align</span> operation.</p>"},{"epoch":201012,"text":"<p>Once you know your attitude reference, you'll want to use it to go places. In spaceflight, this is generally handled through two independent systems.</p><p>The Reaction Control System (<span class=\"glossary-term\">RCS</span>) is a collection of small jets that could fire in a coördinated fashion, to rotate the vehicle.</p><p>To actually accerelate in a direction, the Service Propulsion System (<span class=\"glossary-term\">SPS</span>) in the <span class=\"glossary-term\">Service Module</span> and the Descent Propulsion System (<span class=\"glossary-term\">DPS</span>) in the <span class=\"glossary-term\">Lunar Module</span> are the primary engine systems you'll hear about today.</p>"},{"epoch":201025,"text":"<p>The Reaction Control System (<span class=\"glossary-term\">RCS</span>) is comprised of a variety of what are effectively miniature rocket engines carefully arranged around all three spacecraft. Each jet will, when fired, accelerate the spacecraft around exactly one rotational axis (<span class=\"glossary-term\">pitch</span>, <span class=\"glossary-term\">roll</span>, and <span class=\"glossary-term\">yaw</span>).</p><p>The speed at which the spacecraft is rotating is referred to as a <span class=\"glossary-term\">rate</span>. This can also be used in an accelerative sense: \"picking up rates\" means something is adding to the spacecraft's rotation rate.</p>"},{"epoch":201040,"text":"<p>Recall that there is no air resistance in space, and so there is nothing to naturally slow the spacecraft to a stop if it is spinning. This fact also means that it can be more difficult than it seems to precisely control the vehicle.</p><p>For this reason, Apollo was designed with a variety of assistive control modes to help pilot the craft.</p>"},{"epoch":201050,"text":"<p>Under full computer control, the spacecraft could automatically maintain the spacecraft within a narrow (1°) or wide (5°) deadband of some particular <span class=\"glossary-term\">attitude</span>. It could also automatically perform crew-defined maneuvers to safely drift around to a new target attitude.</p><p>The hand controllers could be used to change the attitude in this <span class=\"glossary-term\">Attitude Hold</span> mode. In this case, the spacecraft will automatically fire opposing thrusters to halt the spacecraft's rotation once the controller was released.</p>"},{"epoch":201060,"text":"<p>In manual flight, the crew could still rely on the electronics to condition their inputs. Under <span class=\"glossary-term\">Minimum Impulse</span> mode, for example, each push of the controller would only pulse the jets the minimum consistent amount. It would have to be released and deflected again to fire a subsequent time.</p><p>In <span class=\"glossary-term\">Acceleration Command</span> mode, the hand controllers more or less directly fired the jets, but still with the help of the electronics to translate the amount of deflection to the thrust output. In both of these modes, the crew was responsible for manually halting any rotation of the vehicle.</p>"},{"epoch":201075,"text":"<p>If the electronics were not available or trustworthy, <span class=\"glossary-term\">Direct</span> RCS mode wired the hand controllers straight to a dedicated set of solenoids to fire the thrusters. Unlike <span class=\"glossary-term\">Accel Command</span>, Direct firing strength is always constant: it does not vary according to controller deflection.</p>"}]},"status":{"events":[{"epoch":200800,"name":"init"},{"epoch":200805,"name":"exploded-1"},{"epoch":200810,"name":"exploded-2"},{"epoch":200870,"name":"s-ivb"},{"epoch":200885,"name":"descent"},{"epoch":200892,"name":"ascent"},{"epoch":200900,"name":"unexploded"},{"epoch":200930,"name":"attitude"},{"epoch":200940,"name":"stars"},{"epoch":200960,"name":"inert"}]},"diagram":{"events":[{"epoch":200960,"name":"imu"},{"epoch":201025,"name":"rcs"},{"epoch":201050,"name":"panel","panel":"mdc","bounds":[[349,1137],[846,1284]]},{"epoch":201075,"name":"panel","panel":"mdc","bounds":[[325,1272],[627,1425]]}]},"meters":{"events":[]},"events":[{"epoch":200771,"panels":[{"name":"narration"}]},{"epoch":200800,"panels":[{"name":"status","weight":60},{"name":"narration"}]},{"epoch":200960,"panels":[{"name":"status"},{"name":"narration","weight":60},{"name":"diagram"}]},{"epoch":201012,"panels":[{"name":"status"},{"name":"narration"}]},{"epoch":201025,"panels":[{"name":"status"},{"name":"narration","weight":60},{"name":"diagram"}]}]}